; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	thermograph0 - mode
	spectrograph1 - mode
	spectrograph2 - mode
	Star1 - direction
	Star3 - direction
	Star0 - direction
	GroundStation2 - direction
	Planet4 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Planet19 - direction
	Phenomenon20 - direction
	Star21 - direction
	Star22 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet4)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument4 spectrograph1)
	(supports instrument4 thermograph0)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 Star1)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 spectrograph2)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 Star3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet9)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 Star3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet10)
	(supports instrument8 spectrograph1)
	(supports instrument8 thermograph0)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 Star0)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 GroundStation2)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star15)
)
(:goal (and
	(pointing satellite1 Planet12)
	(pointing satellite4 Star1)
	(have_image Star5 spectrograph1)
	(have_image Planet7 thermograph0)
	(have_image Phenomenon8 thermograph0)
	(have_image Planet9 thermograph0)
	(have_image Planet10 spectrograph2)
	(have_image Star11 spectrograph2)
	(have_image Planet12 thermograph0)
	(have_image Planet13 thermograph0)
	(have_image Star15 spectrograph1)
	(have_image Phenomenon16 thermograph0)
	(have_image Phenomenon17 thermograph0)
	(have_image Planet18 spectrograph1)
	(have_image Planet19 spectrograph1)
	(have_image Phenomenon20 spectrograph2)
	(have_image Star22 thermograph0)
))

)

; plan
1. (switch_on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 0 of 17
2. (turn_to satellite4 star0 star15)
   deleted: (pointing satellite4 star15)
   added: (pointing satellite4 star0)
   goals met: 0 of 17
3. (calibrate satellite4 instrument8 star0)
   added: (calibrated instrument8)
   goals met: 0 of 17
4. (turn_to satellite4 phenomenon16 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 phenomenon16)
   goals met: 0 of 17
5. (take_image satellite4 phenomenon16 instrument8 thermograph0)
   added: (have_image phenomenon16 thermograph0)
   goals met: 1 of 17
6. (turn_to satellite4 phenomenon17 phenomenon16)
   deleted: (pointing satellite4 phenomenon16)
   added: (pointing satellite4 phenomenon17)
   goals met: 1 of 17
7. (take_image satellite4 phenomenon17 instrument8 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 2 of 17
8. (turn_to satellite4 phenomenon20 phenomenon17)
   deleted: (pointing satellite4 phenomenon17)
   added: (pointing satellite4 phenomenon20)
   goals met: 2 of 17
9. (take_image satellite4 phenomenon20 instrument8 spectrograph2)
   added: (have_image phenomenon20 spectrograph2)
   goals met: 3 of 17
10. (turn_to satellite4 phenomenon8 phenomenon20)
   deleted: (pointing satellite4 phenomenon20)
   added: (pointing satellite4 phenomenon8)
   goals met: 3 of 17
11. (take_image satellite4 phenomenon8 instrument8 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 4 of 17
12. (turn_to satellite4 planet10 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 planet10)
   goals met: 4 of 17
13. (take_image satellite4 planet10 instrument8 spectrograph2)
   added: (have_image planet10 spectrograph2)
   goals met: 5 of 17
14. (turn_to satellite4 planet12 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 planet12)
   goals met: 5 of 17
15. (take_image satellite4 planet12 instrument8 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 6 of 17
16. (turn_to satellite4 planet13 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 planet13)
   goals met: 6 of 17
17. (take_image satellite4 planet13 instrument8 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 7 of 17
18. (turn_to satellite4 planet18 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 planet18)
   goals met: 7 of 17
19. (take_image satellite4 planet18 instrument8 spectrograph1)
   added: (have_image planet18 spectrograph1)
   goals met: 8 of 17
20. (turn_to satellite4 planet19 planet18)
   deleted: (pointing satellite4 planet18)
   added: (pointing satellite4 planet19)
   goals met: 8 of 17
21. (take_image satellite4 planet19 instrument8 spectrograph1)
   added: (have_image planet19 spectrograph1)
   goals met: 9 of 17
22. (turn_to satellite4 planet7 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 planet7)
   goals met: 9 of 17
23. (take_image satellite4 planet7 instrument8 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 10 of 17
24. (turn_to satellite4 planet9 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 planet9)
   goals met: 10 of 17
25. (take_image satellite4 planet9 instrument8 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 11 of 17
26. (turn_to satellite4 star1 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 star1)
   goals met: 12 of 17
27. (turn_to satellite1 planet12 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 planet12)
   goals met: 13 of 17
28. (turn_to satellite4 star11 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 star11)
   goals met: 12 of 17
29. (take_image satellite4 star11 instrument8 spectrograph2)
   added: (have_image star11 spectrograph2)
   goals met: 13 of 17
30. (turn_to satellite4 star1 star11)
   deleted: (pointing satellite4 star11)
   added: (pointing satellite4 star1)
   goals met: 14 of 17
31. (turn_to satellite4 star15 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 star15)
   goals met: 13 of 17
32. (take_image satellite4 star15 instrument8 spectrograph1)
   added: (have_image star15 spectrograph1)
   goals met: 14 of 17
33. (turn_to satellite4 star1 star15)
   deleted: (pointing satellite4 star15)
   added: (pointing satellite4 star1)
   goals met: 15 of 17
34. (turn_to satellite4 star22 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 star22)
   goals met: 14 of 17
35. (take_image satellite4 star22 instrument8 thermograph0)
   added: (have_image star22 thermograph0)
   goals met: 15 of 17
36. (turn_to satellite4 star1 star22)
   deleted: (pointing satellite4 star22)
   added: (pointing satellite4 star1)
   goals met: 16 of 17
37. (turn_to satellite4 star5 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 star5)
   goals met: 15 of 17
38. (take_image satellite4 star5 instrument8 spectrograph1)
   added: (have_image star5 spectrograph1)
   goals met: 16 of 17
39. (turn_to satellite4 star1 star5)
   deleted: (pointing satellite4 star5)
   added: (pointing satellite4 star1)
   goals met: 17 of 17
